In [5]:
def num_dig(dig):
    counter = 0
    dig=str(dig)
    if dig[0] == "-":
        dig = dig[1:]
    for i in dig:
        counter += 1
    print(counter)
    
num_dig(-2344)

4

In [269]:
# import Counter 

str1 = """If you are not located in the United States, you’ll
have to check the laws of the country where you are located before using of the country"""

dic ={}
list1 = []

for i in str1.split(" "):
    if i in dic:
        dic[i]+= 1
    else:
        dic[i] =1
        
print(dic, max(dic.items(), key=lambda k :k[1])) # to get maximum
print(max(dic, key = dic.get))

{'If': 1, 'you': 2, 'are': 2, 'not': 1, 'located': 2, 'in': 1, 'the': 4, 'United': 1, 'States,': 1, 'you’ll\nhave': 1, 'to': 1, 'check': 1, 'laws': 1, 'of': 2, 'country': 2, 'where': 1, 'before': 1, 'using': 1} ('the', 4)
the

In [ ]:
select city, branch, dense_rank(over transaction order by transaction_id group by city, branch_name) as a from (select * from Transaction_tbl as ttbl inner join account_tbl atbl on ttbl.account_id = atbl.account_id) as tatbl
inner join branch_tbl as btbl on tatbl.branch_id = btbl.branch_id where a = 1

In [ ]:
select * from table_name where salary < (select count(distinct(salary) from table_name) order by salary desc limit 1

In [78]:
def num(n):
    result = []
    if n == 0:
        return 0
    if n ==1 or n== 2:
        return 1
    return num(n-1) + num(n-2)

def test(n):
    for i in range(0,n):
        res.append(num(i))
    return res

print(test(9))

[0, 1, 1, 2, 3, 5, 8, 13, 21]

In [107]:
def fibonacci(n):
    sequence = [0,1]
    for i in range(2,n+1):
        next_num = sequence[-1] + sequence[-2]
        sequence.append(next_num)
    return sequence

sequence = fibonacci(10)
print(sequence)

[0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55]

In [118]:
A = "this apple is sweet"
B = "this apple is sour"
    
def uncommon_words(A,B):
    dic = {}
    
    for word in A.split(' '):
        if word not in dic:
            dic[word] =0
        dic[word] += 1
        
    for word in B.split(' '):
        if word not in dic:
              dic[word] =0
        dic[word] += 1
    
    res = []
    
    for key, value in dic.items():
        if value == 1:
            res.append(key)
    return res, dic

print(uncommon_words(A,B))

(['sweet', 'sour'], {'this': 2, 'apple': 2, 'is': 2, 'sweet': 1, 'sour': 1})

In [152]:
def isValid(s):
    dic = {'(':')','[':']','{':'}'}
    st = []
    for i in s:
        if i in "({[":
            st.append(i) 
        elif len(st) == 0 or i != dic[st.pop()]:
            return False
    return True
        
print(isValid("{([])}"))

True

In [ ]:
Dataframe with 3 columns: State, City, Population

Can you write a code in python to identify cities with population higher than State average

In [129]:
import pandas ad pd
df[['Cities','Population']] = df[df['Population'] > df['State']]

df_cities_avg = df.groupby('State')['Population'].mean().reset_index()

for i in df():
    if i.state == df_cities_avg['state'] and i.population > df_cities_avg['Population']:
        print(i.cities)

In [ ]:
s1 c1 p1
Up Kanpur 10000
Up Agra   8000
MP Bhopal  11000
MP Indore 9000
HR Gurgaoun 6000

In [307]:
# X
# X X
# X X X 
# X X X X

for i in range(4,0,-1):
    res = i*'x'
    print(res)

for i in range(0,5):
    res = i*'x'
    print(res)

n=5
for i in range(n):
    for j in range(n-i-1):
        print(' ', end ='')
    print('x'*i)

xxxx
xxx
xx
x

x
xx
xxx
xxxx

   x
  xx
 xxx
xxxx

In [155]:
num = 123
rev = 0
while num >0:
    a = num%10
    rev = rev*10 +a
    num = num //10

print(rev)

321

In [24]:
Input = "babad"
Output = "bab"
# Explanation: "aba" is also a valid answer.


def max_sub_palindrom(input_str):
    temp = ''
    lis = []
    counter =0
    for i in input_str:
        temp = temp + i
        if temp == temp[::-1]:
            lis.append(temp)
        else:
            temp1 = temp[counter:] 
            if temp1 == temp1[::-1]:
                lis.append(temp1)
            counter += 1
    print(lis)
    max_palindrom = max(lis, key= len)
    return max_palindrom  

print(max_sub_palindrom("babad"))
print(max_sub_palindrom("Geeks"))
# print(max_sub_palindrom("forgeeksskeegfor"))

['b', 'a', 'bab', 'a', 'd']
bab
['G', 'e', 'e', 'k', 's']
G
['f', 'o', 'r', 'g', 'e', 'e', 'k', 's', 's', 'k', 'e', 'e', 'g', 'f', 'o', 'r']
f

In [59]:
V = ['A','E','I','O','U']
S = ['password@123', 'XYZabcd', 'LMN123', 'ZZZZ78910']
I = ["h","e","l","l","o"]

dic = {k:v for v,k in enumerate(V)}

# print(*(dic[k] for k in I))

for i in V:
    if 'A' in 'RIMANSHU':
        print('Success')

Success

In [392]:
import pandas as pd

# data = {'Name':['jack','jack','Tom','Tom','jack','jack','jack','jack','Tom','abc'], 
#         'Age':[10,20,30,40,50,60,70,80,90,100]}
 
# df = pd.DataFrame(data)
# # df
name_list = list(df['Name'])
age_list = list(df['Age'])


rank_list = []
counter = 0
test = 0
age = 0
dic_sam = {}
for i in range(len(name_list)):
    if name_list[i] == name_list[i-1]:
        counter = counter
    else:
        counter += 1
    rank_list.append(counter)
    
    test=list(zip(name_list, age_list,rank_list))

    print(test[i],'Second ... ', test[i-1])
    if test[i][0] == test[i-1][0] :
        age = test[i][1] + age
        print('Sum is ..', age ,'and i is ', i)
        dic_sam[test[i][2]] = age
        
    else:
        age = 0
        age = test[i][1]
        print('else Sum is ..', age ,'and i is ', i)
        dic_sam[test[i][2]] = age
        
test = list(zip(*test))
del test[1]
test = zip(list(test[0]),list(test[1]))
test = list(dict.fromkeys(test))
test = list(zip(*test))
print(list(dict.fromkeys(test)))

print(dic_sam)


df_1 = pd.DataFrame({'Name':list(test[0]), 'Age':dic_sam.values()})
df_1.head()

('a', 1, 1) Second ...  ('a', 1, 1)
Sum is .. 1 and i is  0
('a', 9, 1) Second ...  ('a', 1, 1)
Sum is .. 10 and i is  1
('b', 2, 2) Second ...  ('a', 9, 1)
else Sum is .. 2 and i is  2
('b', 4, 2) Second ...  ('b', 2, 2)
Sum is .. 6 and i is  3
('c', 7, 3) Second ...  ('b', 4, 2)
else Sum is .. 7 and i is  4
('c', 8, 3) Second ...  ('c', 7, 3)
Sum is .. 15 and i is  5
('c', 2, 3) Second ...  ('c', 8, 3)
Sum is .. 17 and i is  6
('a', 1, 4) Second ...  ('c', 2, 3)
else Sum is .. 1 and i is  7
('a', 8, 4) Second ...  ('a', 1, 4)
Sum is .. 9 and i is  8
('b', 9, 5) Second ...  ('a', 8, 4)
else Sum is .. 9 and i is  9
[('a', 'b', 'c', 'a', 'b'), (1, 2, 3, 4, 5)]
{1: 10, 2: 6, 3: 17, 4: 9, 5: 9}

  Name  Age
0    a   10
1    b    6
2    c   17
3    a    9
4    b    9

In [348]:
test_list = [('jack', 'Tom', 'jack', 'Tom', 'abc'), (1, 2, 3, 4, 5)]
test_dic = {1: 30, 2: 70, 3: 260, 4: 90, 5: 100}

#test_dic.keys() = test_list[0]
print(test_dic.values())

dict_values([30, 70, 260, 90, 100])

In [602]:
import pandas as pd

df_data = pd.read_csv(r"C:\Users\riman\Git\data.csv")
df_data.head()

,sap_stp,CLUSTER,Brand_ID,pack_size,pack_type,year,month,regional_group,value,volume
0,308802,Low_Income,Brand_7,500ML,CAN,2019,12,Retailer 1,435447.0,18932.47826
1,314563,Low_Mid_Income,Brand_7,500ML,CAN,2018,12,Retailer 1,373385.6,15557.73333
2,318310,Low_Income,Brand_7,500ML,CAN,2018,12,Retailer 1,341035.5,17051.77500
3,308802,Low_Income,Brand_7,500ML,CAN,2018,12,Retailer 1,316701.9,13769.64783
4,314705,High_Income,Brand_7,340ML,NRB,2019,12,Retailer 1,308547.6,12341.90400

In [657]:
#df_data.year.unique()

df_test = df_data.groupby('year')['month'].nunique()
df_test = df_test.reset_index()
df_test['month'].sum()

22

In [626]:
df_data.columns

Index(['sap_stp', 'CLUSTER', 'Brand_ID', 'pack_size', 'pack_type', 'year',
       'month', 'regional_group', 'value', 'volume'],
      dtype='object')

In [635]:
for i in df_data.columns:
    print(len(df_data[i].unique()))

12
4
270
23
4
3
12
1
19981
27486

In [650]:


df_data['CLUSTER'].value_counts()

High_Income        11851
Mid_High_Income    10912
Low_Mid_Income     10845
Low_Income         10652
Name: CLUSTER, dtype: int64

In [651]:
df_data.head()

,sap_stp,CLUSTER,Brand_ID,pack_size,pack_type,year,month,regional_group,value,volume
0,308802,Low_Income,Brand_7,500ML,CAN,2019,12,Retailer 1,435447.0,18932.47826
1,314563,Low_Mid_Income,Brand_7,500ML,CAN,2018,12,Retailer 1,373385.6,15557.73333
2,318310,Low_Income,Brand_7,500ML,CAN,2018,12,Retailer 1,341035.5,17051.77500
3,308802,Low_Income,Brand_7,500ML,CAN,2018,12,Retailer 1,316701.9,13769.64783
4,314705,High_Income,Brand_7,340ML,NRB,2019,12,Retailer 1,308547.6,12341.90400

In [652]:
df_data['SKU'] = df_data['Brand_ID'] + '_' + df_data['pack_size'] + '_' + df_data['pack_type']
df_data.head()

,sap_stp,CLUSTER,Brand_ID,pack_size,pack_type,year,month,regional_group,value,volume,SKU
0,308802,Low_Income,Brand_7,500ML,CAN,2019,12,Retailer 1,435447.0,18932.47826,Brand_7_500ML_CAN
1,314563,Low_Mid_Income,Brand_7,500ML,CAN,2018,12,Retailer 1,373385.6,15557.73333,Brand_7_500ML_CAN
2,318310,Low_Income,Brand_7,500ML,CAN,2018,12,Retailer 1,341035.5,17051.77500,Brand_7_500ML_CAN
3,308802,Low_Income,Brand_7,500ML,CAN,2018,12,Retailer 1,316701.9,13769.64783,Brand_7_500ML_CAN
4,314705,High_Income,Brand_7,340ML,NRB,2019,12,Retailer 1,308547.6,12341.90400,Brand_7_340ML_NRB

In [655]:
df_data['SKU_test'] = df_data['value']/df_data['volume']
df_data.head()

df_data.groupby('SKU')['SKU_test'].agg(['max','min','std'])

                      max   min       std
SKU
Brand_100_330ML_NRB  25.0  20.0  1.753568
Brand_101_330ML_NRB  25.0  20.0  1.806411
Brand_102_275ML_NRB  25.0  20.0  1.609879
Brand_103_500ML_CAN  25.0  20.0  1.687034
Brand_104_330ML_NRB  25.0  20.0  2.190890
...                   ...   ...       ...
Brand_96_500ML_NRB   25.0  20.0  1.766088
Brand_97_275ML_NRB   25.0  20.0  1.643064
Brand_98_330ML_NRB   25.0  20.0  1.714557
Brand_99_3L_RB       25.0  20.0  1.647945
Brand_9_300ML_NRB    25.0  20.0  1.671813

[406 rows x 3 columns]

In [233]:
import pandas as pd

df = pd.read_csv(r"C:\Users\riman\Downloads\StudentsPerformance.csv")
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,roll_number
0,male,group B,some college,free/reduced,none,NaN,43.0,39.0,1
1,male,group D,associate's degree,standard,none,NaN,52.0,43.0,2
2,male,group E,associate's degree,free/reduced,completed,100.0,100.0,93.0,3
3,female,group E,some college,standard,none,100.0,92.0,97.0,4
4,female,group E,bachelor's degree,standard,none,100.0,100.0,100.0,5

In [148]:
df.columns.str.lower().str.replace(' ', '_')

Index(['gender', 'race/ethnicity', 'parental_level_of_education', 'lunch',
       'test_preparation_course', 'math_score', 'reading_score',
       'writing_score', 'roll_number'],
      dtype='object')

In [149]:
list1 = df.columns

print(list(list1))

var = []
for i in list(list1):
    var.append('_'.join(i.split(' ')))

print(var)

df.columns = var

df.head()

['gender', 'race/ethnicity', 'parental level of education', 'lunch', 'test preparation course', 'math score', 'reading score', 'writing score', 'roll_number']
['gender', 'race/ethnicity', 'parental_level_of_education', 'lunch', 'test_preparation_course', 'math_score', 'reading_score', 'writing_score', 'roll_number']

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score,roll_number
0,male,group B,some college,free/reduced,none,NaN,43.0,39.0,1
1,male,group D,associate's degree,standard,none,NaN,52.0,43.0,2
2,male,group E,associate's degree,free/reduced,completed,100.0,100.0,93.0,3
3,female,group E,some college,standard,none,100.0,92.0,97.0,4
4,female,group E,bachelor's degree,standard,none,100.0,100.0,100.0,5

In [15]:
# df.math_score.isna().value_counts()
# df.reading_score.isna().value_counts()
df.writing_score.isna().value_counts()

False    996
True       4
Name: writing_score, dtype: int64

In [20]:
df.math = df.math_score.dropna()
mean1 = df.math.mean()

df.math_score.fillna(mean1, inplace=True)

In [21]:
df.read = df.reading_score.dropna()
mean1 = df.read.mean()

df.reading_score.fillna(mean1,inplace=True)

In [22]:
df.write = df.writing_score.dropna()
mean1 = df.write.mean()

df.writing_score.fillna(mean1, inplace = True)

In [23]:
df.head()

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score,roll_number
0,male,group B,some college,free/reduced,none,66.122736,43.0,39.0,1
1,male,group D,associate's degree,standard,none,66.122736,52.0,43.0,2
2,male,group E,associate's degree,free/reduced,completed,100.000000,100.0,93.0,3
3,female,group E,some college,standard,none,100.000000,92.0,97.0,4
4,female,group E,bachelor's degree,standard,none,100.000000,100.0,100.0,5

In [30]:
df['avg_score'] = (df.math_score + df.reading_score + df.writing_score)/3

In [31]:
df.head()

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score,roll_number,avg_score
0,male,group B,some college,free/reduced,none,66.122736,43.0,39.0,1,49.374245
1,male,group D,associate's degree,standard,none,66.122736,52.0,43.0,2,53.707579
2,male,group E,associate's degree,free/reduced,completed,100.000000,100.0,93.0,3,97.666667
3,female,group E,some college,standard,none,100.000000,92.0,97.0,4,96.333333
4,female,group E,bachelor's degree,standard,none,100.000000,100.0,100.0,5,100.000000

In [ ]:
>=90 as A , >=75 as B , >=50 as C , >=35 as D else F

In [43]:
def grade(score):
    if score >=90:
        return 'A'
    elif score >=75:
        return 'B'
    elif score >=50:
        return 'C'
    elif score >=35:
        return 'D'
    else:
        return 'F'

In [55]:
df['grade'] = df['avg_score'].map(grade)

In [56]:
df.head()

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score,roll_number,avg_score,grade
0,male,group B,some college,free/reduced,none,66.122736,43.0,39.0,1,49.374245,D
1,male,group D,associate's degree,standard,none,66.122736,52.0,43.0,2,53.707579,C
2,male,group E,associate's degree,free/reduced,completed,100.000000,100.0,93.0,3,97.666667,A
3,female,group E,some college,standard,none,100.000000,92.0,97.0,4,96.333333,A
4,female,group E,bachelor's degree,standard,none,100.000000,100.0,100.0,5,100.000000,A

In [63]:
df.groupby(['gender','race/ethnicity','grade']).count()

                             parental_level_of_education  lunch  \
gender race/ethnicity grade
female group A        A                                1      1
                      B                                9      9
                      C                               22     22
                      D                                4      4
       group B        A                                5      5
                      B                               32     32
                      C                               55     55
                      D                                7      7
                      F                                5      5
       group C        A                                9      9
                      B                               51     51
                      C                              106    106
                      D                               10     10
                      F                                4      4
       group D        A                               11     11
                      B                               39     39
                      C                               75     75
                      D                                2      2
                      F                                2      2
       group E        A                               12     12
                      B                               21     21
                      C                               31     31
                      D                                4      4
                      F                                1      1
male   group A        A                                3      3
                      B                                6      6
                      C                               32     32
                      D                               11     11
                      F                                1      1
       group B        A                                2      2
                      B                               17     17
                      C                               52     52
                      D                               13     13
                      F                                2      2
       group C        A                                6      6
                      B                               28     28
                      C                               87     87
                      D                               16     16
                      F                                2      2
       group D        A                                1      1
                      B                               37     37
                      C                               81     81
                      D                               14     14
       group E        A                                2      2
                      B                               31     31
                      C                               34     34
                      D                                3      3
                      F                                1      1

                             test_preparation_course  math_score  \
gender race/ethnicity grade
female group A        A                            1           1
                      B                            9           9
                      C                           22          22
                      D                            4           4
       group B        A                            5           5
                      B                           32          32
                      C                           55          55
                      D                            7           7
                      F                            5           5
       group C        A                            9           9
                      B                           51          51
                      C                          106         106
                      D                           10          10
                      F                            4           4
       group D        A                           11          11
                      B                           39          39
                      C                           75          75
                      D                            2           2
                      F                            2           2
       group E        A                           12          12
                      B                           21          21
                      C                           31          31
                      D                            4           4
                      F                            1           1
male   group A        A                            3           3
                      B                            6           6
                      C                           32          32
                      D                           11          11
                      F                            1           1
       group B        A                            2           2
                      B                           17          17
                      C                           52          52
                      D                           13          13
                      F                            2           2
       group C        A                            6           6
                      B                           28          28
                      C                           87          87
                      D                           16          16
                      F                            2           2
       group D        A                            1           1
                      B                           37          37
                      C                           81          81
                      D                           14          14
       group E        A                            2           2
                      B                           31          31
                      C                           34          34
                      D                            3           3
                      F                            1           1

                             reading_score  writing_score  roll_number  \
gender race/ethnicity grade
female group A        A                  1              1            1
                      B                  9              9            9
                      C                 22             22           22
                      D                  4              4            4
       group B        A                  5              5            5
                      B                 32             32           32
                      C                 55             55           55
                      D                  7              7            7
                      F                  5              5            5
       group C        A                  9              9            9
                      B                 51             51           51
                      C                106            106          106
                      D                 10             10           10
                      F                  4              4            4
       group D        A                 11             11           11
                      B                 39             39           39
                      C                 75             75           75
                      D                  2              2            2
                      F                  2              2            2
       group E        A                 12             12           12
                      B                 21             21           21
                      C                 31             31           31
                      D                  4              4            4
                      F                  1              1            1
male   group A        A                  3              3            3
                      B                  6              6            6
                      C                 32             32           32
                      D                 11             11           11
                      F                  1              1            1
       group B        A                  2              2            2
                      B                 17             17           17
                      C                 52             52           52
                      D                 13             13           13
                      F                  2              2            2
       group C        A                  6              6            6
                      B                 28             28           28
                      C                 87             87           87
                      D                 16             16           16
                      F                  2              2            2
       group D        A                  1              1            1
                      B                 37             37           37
                      C                 81             81           81
                      D                 14             14           14
       group E        A                  2              2            2
                      B                 31             31           31
                      C                 34             34           34
                      D                  3              3            3
                      F                  1              1            1

                             avg_score
gender race/ethnicity grade
female group A        A              1
                      B              9
                      C             22
                      D              4
       group B        A              5
                      B             32
                      C             55
                      D              7
                      F              5
       group C        A              9
                      B             51
                      C            106
                      D             10
                      F              4
       group D        A             11
                      B             39
                      C             75
                      D              2
                      F              2
       group E        A             12
                      B             21
                      C             31
                      D              4
                      F              1
male   group A        A              3
                      B              6
                      C             32
                      D             11
                      F              1
       group B        A              2
                      B             17
                      C             52
                      D             13
                      F              2
       group C        A              6
                      B             28
                      C             87
                      D             16
                      F              2
       group D        A              1
                      B             37
                      C             81
                      D             14
       group E        A              2
                      B             31
                      C             34
                      D              3
                      F              1

In [324]:
# Sort an array based on the frequency of numbers, in case of a tie,
# smallest takes precedence
array = [3, 1, 4, 3, 1, 1, 3, 1, 2, 4, 2, 5]
output_expected = [1, 1, 1, 1, 3, 3, 3, 2, 2, 4, 4, 5]

print(sorted(array,key=array.count, reverse=True))

[1, 1, 1, 1, 3, 3, 3, 4, 2, 4, 2, 5]

In [339]:
print(10//2)

5

In [335]:
def factorial(n):
    fact = 1
    for num in range(2, n + 1):
        fact *= num
    return fact



def factorial(n):
    if n < 2:
        return 1
    else:
        return n * factorial(n-1)
    
print(factorial(3))

6

In [328]:
# 2nd questions is - 103! ka traliing zeros nikalne hai 

def getTrailingZeroes(n):
    factorial = 1
    zeroes = 0
    for i in range(1, n + 1):
        factorial *= i
    while factorial % 10 == 0:
        factorial //= 10
        zeroes += 1
    return zeroes

getTrailingZeroes(103)

24

In [ ]:
S = a*b+c*a



a = odd - .5
b = odd - .5
c = odd - .5
S = Even - .125

a = Even - .5
b = odd -.5
c = odd - .5
S = Even - .125

a = Even
b = odd
c = Even
S = Even

a = Even
b = Even
c = odd
S = Even

a = odd
b = Even
c = Even
S = Even

a = Even
b = Even
c = Even
S = Even

In [92]:
print("***".join(['A','B','C']))

A***B***C

In [ ]:
silver , bronze, gold

Marketing promotions for gold customers

top 5 gold customers.

Transaction dataset - Transaction date , store number, transaction id, customer id, item id, quamtity, sales value

Cusotmer dataset - customer id, membership level, date of joining

list of 500 customer id who are gold level cusotmners and who have spent atleast 50 dollors in coffee category(Item id is ABC)
over lst 90 days.

df_trans = df_transactional[df_transaction['item_id']='ABC' & df_transaction['Transaction_date']>='29/06/2022' 
                            & df_transaction['Transaction_date']<='29/08/2022'].groupby('customer_id')['Transaction_date','item_id','sales']


df_final = 


select T.Item_id, T.Sales , T.Transaction Date C.Customer_id,C.Membership_level from Transaction T inner join Customer C on T.cusotmer_id = C.cusotmer_id where T.item_id = 'ABC'
T.transaction_date between '29/06/2022' and '29/08/2022' group by customer_id

In [ ]:
# Create a class 'Currency'

# The main utility of this class is that it holds a currency value and can toggle between 2 currency types,
# and display its value.

# The class takes in 2 arguments: 'amount' of type float and 'curr_type' of type string.

# Enforce the condition that:
# - 1. Currency can never be set to be -ve. So, if -ve, raise an exception stating "Error: Currency amount cannot be negative"
# - 2. Currency type can only be one of GBP or INR. If neither, raise an exception stating "Error: Currency type must be either 'GBP' or 'INR'"

# Create a method 'display' that simply prints the currency value like so, for e.g.: "GBP 20"

# Once a currency object has been created, the user:
#  - 1. must NOT be able to change the amount (which makes sense, nobody should be able to freely tamper with the actual value)
#  - 2. must be able to change the currency type (hence, make this attribute a property by implementing a getter and setter for it)

# To create a getter and setter (can refer to Google if unfamiliar) for curr_type
#   Note the following changes must be incorporated while implementing the setter:
#   - 1. Can only accept 'GBP' or 'INR' values
#   - 2. Must also change the amount as per the currency type (else, the value or purchasing power won't remain the same)
# For our example, consider 1 GBP = 100 INR

# ---- For reference on getters and setter -----
# 1st or 2nd answer on https://stackoverflow.com/questions/2627002/whats-the-pythonic-way-to-use-getters-and-setters

In [16]:
# Initializing list
l = [1, 2, 3, 4]
  
res = list(map(lambda x: x ** 3, l))
print(res)

[1, 8, 27, 64]

In [15]:
class Currency:
    def __init__(self, amount, curr_type):
        self.amount = amount
        self.curr_type = curr_type
    
    def display(self):
        try:
            if self.amount < 0:
                print("Error: Currency amount cannot be negative")
            if self.curr_type not in ["GBP", "INR"]:
                print("Error: Currency type must be either 'GBP' or 'INR'")
                
            print("Currency value is ", str(self.curr_type) +" " +str(self.amount))
        except Exception as e:
            print("Exception is ", e)
            

curr_object = Currency(14, "INR")
print(curr_object.display())

Currency value is  INR 14
None

In [342]:

Students = {
    'name' : ['Jack', 'Riti', 'Aadi', 'Mohak', 'Vijay', 'Tapasi','Jack'],
    'dob': ['1993101','19930511','19900501','19980130','20000530','19930101','19900101'],
    'age' : [28, 28, 32, 23, 21, 37, 32],
    'city' : ['Sydney', 'Delhi', 'New york', 'Delhi', 'New york', 'Punjab', 'Punjab']
}

# Youngest student name from each city.

# Eliminate vowels from city names.

In [350]:
import pandas as pd

df = pd.DataFrame(Students)
df

     name       dob  age      city
0    Jack   1993101   28    Sydney
1    Riti  19930511   28     Delhi
2    Aadi  19900501   32  New york
3   Mohak  19980130   23     Delhi
4   Vijay  20000530   21  New york
5  Tapasi  19930101   37    Punjab
6    Jack  19900101   32    Punjab

In [357]:
df.groupby('city')['name'].min('age')

city
Delhi       Mohak
New york     Aadi
Punjab       Jack
Sydney       Jack
Name: name, dtype: object

In [2]:
import pandas as pd

df = pd.read_csv(r"C:\Users\riman\Downloads\T1.csv")
    
df.head()

,Date/Time,LV ActivePower (kW),Wind Speed (m/s),Theoretical_Power_Curve (KWh),Wind Direction (°)
0,01 01 2018 00:00,380.047791,5.311336,416.328908,259.994904
1,01 01 2018 00:10,453.769196,5.672167,519.917511,268.641113
2,01 01 2018 00:20,306.376587,5.216037,390.900016,272.564789
3,01 01 2018 00:30,419.645905,5.659674,516.127569,271.258087
4,01 01 2018 00:40,380.650696,5.577941,491.702972,265.674286

In [3]:
temp_list = ['Date/Time','LV ActivePower (kW)','Wind Speed (m/s)','Theoretical_Power_Curve (KWh)','Wind Direction (°)','a','b']
    
print(list(df.columns))

['Date/Time', 'LV ActivePower (kW)', 'Wind Speed (m/s)', 'Theoretical_Power_Curve (KWh)', 'Wind Direction (°)']

In [4]:
[temp_list.remove(i) for i in temp_list if i not in list(df.columns)]
print(temp_list)

['Date/Time', 'LV ActivePower (kW)', 'Wind Speed (m/s)', 'Theoretical_Power_Curve (KWh)', 'Wind Direction (°)', 'b']

In [5]:
temp_list.pop()
temp_list.pop()

'Wind Direction (°)'

In [5]:
print(temp_list)

['Date/Time', 'LV ActivePower (kW)', 'Wind Speed (m/s)', 'Theoretical_Power_Curve (KWh)']

In [6]:
df = df[temp_list]
df.head()

,Date/Time,LV ActivePower (kW),Wind Speed (m/s),Theoretical_Power_Curve (KWh)
0,01 01 2018 00:00,380.047791,5.311336,416.328908
1,01 01 2018 00:10,453.769196,5.672167,519.917511
2,01 01 2018 00:20,306.376587,5.216037,390.900016
3,01 01 2018 00:30,419.645905,5.659674,516.127569
4,01 01 2018 00:40,380.650696,5.577941,491.702972

In [7]:
df = df[df["LV ActivePower (kW)"] < 300]
df = df[df["Theoretical_Power_Curve (KWh)"] < 300]

df.head()
# df["LV ActivePower (kW)"] < 300] & df["Theoretical_Power_Curve (KWh)"]< 300]]

,Date/Time,LV ActivePower (kW),Wind Speed (m/s),Theoretical_Power_Curve (KWh)
65,01 01 2018 10:50,230.055496,4.603875,244.316244
66,01 01 2018 11:00,233.990601,4.554534,233.632781
67,01 01 2018 11:10,175.592194,4.263629,173.573663
68,01 01 2018 11:20,118.133102,3.894139,108.571221
69,01 01 2018 11:30,142.202499,4.038761,130.229990

In [ ]:
import matplotlib.pyplot as plt


plt.plot(df['Date/Time'], df['LV ActivePower (kW)'])
plt.show()

In [8]:
df['deviation'] = df["LV ActivePower (kW)"] - df["Theoretical_Power_Curve (KWh)"]
df.head()

,Date/Time,LV ActivePower (kW),Wind Speed (m/s),Theoretical_Power_Curve (KWh),deviation
65,01 01 2018 10:50,230.055496,4.603875,244.316244,-14.260748
66,01 01 2018 11:00,233.990601,4.554534,233.632781,0.357820
67,01 01 2018 11:10,175.592194,4.263629,173.573663,2.018530
68,01 01 2018 11:20,118.133102,3.894139,108.571221,9.561881
69,01 01 2018 11:30,142.202499,4.038761,130.229990,11.972510

In [28]:
import pandas as pd

df = pd.read_csv(r"C:\Users\riman\Downloads\archive\winequality-red.csv")
df.head()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5
1,7.8,0.88,0.00,2.6,0.098,25.0,67.0,0.9968,3.20,0.68,9.8,5
2,7.8,0.76,0.04,2.3,0.092,15.0,54.0,0.9970,3.26,0.65,9.8,5
3,11.2,0.28,0.56,1.9,0.075,17.0,60.0,0.9980,3.16,0.58,9.8,6
4,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1599 entries, 0 to 1598
Data columns (total 12 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   fixed acidity         1599 non-null   float64
 1   volatile acidity      1599 non-null   float64
 2   citric acid           1599 non-null   float64
 3   residual sugar        1599 non-null   float64
 4   chlorides             1599 non-null   float64
 5   free sulfur dioxide   1599 non-null   float64
 6   total sulfur dioxide  1599 non-null   float64
 7   density               1599 non-null   float64
 8   pH                    1599 non-null   float64
 9   sulphates             1599 non-null   float64
 10  alcohol               1599 non-null   float64
 11  quality               1599 non-null   int64
dtypes: float64(11), int64(1)
memory usage: 150.0 KB

In [30]:
df.quality.unique()

array([5, 6, 7, 4, 8, 3], dtype=int64)

In [32]:
review = []

for i in df['quality']:
    if i >= 1 and i <=3:
        review.append('1')
    elif i >=4 and i <=7:
        review.append('2')
    elif i >=8 and i <=10:
        review.append('3')
        
df['review'] = review

In [33]:
df.review.value_counts()

2    1571
3      18
1      10
Name: review, dtype: int64

In [43]:
x = df.iloc[:,:11]
y = df['review']

In [44]:
from sklearn.preprocessing import StandardScaler

sc = StandardScaler()
x = sc.fit_transform(x)

In [55]:
from sklearn.model_selection import train_test_split

x_train, x_test, y_train, y_test = train_test_split(x,y, test_size=.25)

In [50]:
x_train.shape
y_train.shape

(1199,)

In [38]:
from sklearn.metrics import accuracy_score, classification_report, f1_score, confusion_matrix

from sklearn.ensemble import RandomForestClassifier
from sklearn.tree import DecisionTreeClassifier
from sklearn.linear_model import LogisticRegression
from sklearn.svm import SVC

In [78]:
lr = LogisticRegression()
lr.fit(x_train, y_train)
prediction = lr.predict(x_test)
print("Accuracy", accuracy_score(y_test, prediction)*100)

Accuracy 97.75

In [79]:
RF = RandomForestClassifier()
RF.fit(x_train, y_train)
prediction = lr.predict(x_test)
print("Accuracy", accuracy_score(y_test, prediction)*100)

Accuracy 97.75

In [81]:
SVC = SVC()
SVC.fit(x_train, y_train)
prediction = lr.predict(x_test)
print("Accuracy", accuracy_score(y_test, prediction)*100)

Accuracy 97.75

In [92]:
import pandas as pd
import numpy as np
from sklearn.ensemble import RandomForestClassifier
from sklearn.metrics import accuracy_score, classification_report

xtrain = pd.read_csv(r"C:\Users\riman\Downloads\archive\winequality-red.csv")

xtrain['taste'] = np.where(xtrain['quality'] <6, 0,np.where(xtrain['quality']==6,1,np.where(xtrain['quality']>6,2,'error')))

def taste_map(df):
    taste = []
    for i in df['quality']:
        if i <6:
            taste.append(0)
        elif i==6:
            taste.append(1)
        elif i > 6:
            taste.append(2)
    return taste

xtrain['taste'] = taste_map(xtrain)

del xtrain['quality']

print(xtrain['taste'].value_counts())

columns = [i for i in xtrain.columns if i!= 'taste']
print(columns)

rf_model = RandomForestClassifier(n_estimators = 95, random_state=1024, n_jobs=-1).fit(xtrain[columns],xtrain['taste'])

print(rf_model.feature_importances_)
print(classification_report(xtrain['taste'], rf_model.predict(xtrain[columns])))
print(accuracy_score(xtrain['taste'], rf_model.predict(xtrain[columns])))

output_predictions = rf_model.predict(xtest[columns])

finalOutput = pd.DataFrame({'id':xtest['id'],
                           'taste':output_predictions})

def taste_map1(x):
    if x=='0':
        return 'bad'
    elif x=='1':
        return 'normal'
    elif x =='2':
        return 'good'
    else:
        return 'nothing'
    
print(type(finalOutput['taste'].iloc[0]))

finalOutput['taste'] = finalOutput['taste'].apply(lambda x:taste_map1(x))

print(finalOutput['taste'].value_counts())

finalOutput.to_csv(....., index=False)

3    744
2    638
1    217
Name: taste, dtype: int64
['fixed acidity', 'volatile acidity', 'citric acid', 'residual sugar', 'chlorides', 'free sulfur dioxide', 'total sulfur dioxide', 'density', 'pH', 'sulphates', 'alcohol']
[0.07079735 0.10822308 0.07423566 0.06741293 0.07986083 0.06475916
 0.10171108 0.08961263 0.07189167 0.12130741 0.1501882 ]
              precision    recall  f1-score   support

           1       1.00      1.00      1.00       217
           2       1.00      1.00      1.00       638
           3       1.00      1.00      1.00       744

    accuracy                           1.00      1599
   macro avg       1.00      1.00      1.00      1599
weighted avg       1.00      1.00      1.00      1599

1.0

In [ ]:
from sklearn.neighbors import KNeighborsClassifier
import pandas as pd

train = pd.read_csv(.....)

del train['ID']
del train['TimeStamp']

column =[i for i in train.columns if i !='GTOcuupancy']

knn = KNeighborsClassifier(n_neighbors = 4).fit(train[columns], train['GTOccupancy'])

test = pd.read_csv(.....)

output_prediction = knn.predict(test[column])

output_df = pd.DataFrame({'ID': test['ID'],
                         "Occupancy": output_prediction})

In [106]:
list_1 = [[11,12,13,14,15],[1,2,3,4,5],[6,7,8,9,10]]

# [[1,6,11],
# [2,7,12],
# [3,8,13],
# [4,9,14],
# [5,10,15]]

In [358]:
test = list(zip(*list_1))
    
test1 = []

for i in test:
    test1.append(list(sorted(i)))
    
print(test1)

[[1, 6, 11], [2, 7, 12], [3, 8, 13], [4, 9, 14], [5, 10, 15]]

In [ ]:
Find all the continuous subarrays having sum equals to K.

e.g. 1 
[1,1,1], k = 2
Output: [1,1]; [1,1]

e.g. 2  
[9, 4, 20, 3, 10, 5], k = 33
Output: [9,4,20]; [20,3,10]

In [360]:
arr = [9, 4, 20, 3, 10, 5]
k = 33
n = len(arr)
test = []
res = 0
for i in range(n):
    summ = 0
    test = []
    for j in range(i,n):
        summ+= arr[j]
        test.append(arr[j])
        if summ == k:
            print(test)
            res +=1
            
print(res)

[9, 4, 20]
[20, 3, 10]
2

In [380]:
import pandas as pd
df = pd.DataFrame({'A':[1,1,2,2,3],'B':[6,8,4,5,6]})

test = list(df.groupby('A')['B'].mean())

In [390]:
from collections import Counter
list1 = [1,1,2,2,3]
Counter(list1)

test_list = []
for key, value in Counter(list1).items():
    test_list.append(value)

In [393]:
print(test)
print(test_list)

[7.0, 4.5, 6.0]
[2, 2, 1]

In [395]:
final_mean_value = [a for a, f in zip(test, test_list) for _ in range(f)]

df["C"] = final_mean_value
df

   A  B    C
0  1  6  7.0
1  1  8  7.0
2  2  4  4.5
3  2  5  4.5
4  3  6  6.0

In [399]:
def prime(num):
    if num%2 ==0 and num%num ==0:
        print("Number is prime number")
    else:
        print("Number is not prime number")
        
prime(4)

Number of prime number

In [454]:
import pandas as pd

df = pd.read_csv(r"C:\Users\riman\Downloads\train_loan_pred.csv")

df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [445]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            614 non-null    object
 1   Gender             601 non-null    object
 2   Married            611 non-null    object
 3   Dependents         599 non-null    object
 4   Education          614 non-null    object
 5   Self_Employed      582 non-null    object
 6   ApplicantIncome    614 non-null    int64
 7   CoapplicantIncome  614 non-null    float64
 8   LoanAmount         592 non-null    float64
 9   Loan_Amount_Term   600 non-null    float64
 10  Credit_History     564 non-null    float64
 11  Property_Area      614 non-null    object
 12  Loan_Status        614 non-null    object
dtypes: float64(4), int64(1), object(8)
memory usage: 62.5+ KB

In [452]:
df.shape

(564, 13)

In [455]:
df.isnull().sum()

Loan_ID               0
Gender               13
Married               3
Dependents           15
Education             0
Self_Employed        32
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Loan_Amount_Term     14
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64

In [456]:
df.dropna(subset=['Credit_History'],how='all', inplace=True)

In [462]:
df.Married.fillna(df.Married.mode()[0],inplace=True)
df.Gender.fillna(df.Gender.mode()[0],inplace=True)
df.Dependents.fillna(df.Dependents.mode()[0],inplace=True)
df.Self_Employed.fillna(df.Self_Employed.mode()[0],inplace=True)
df.LoanAmount.fillna(df.LoanAmount.mean(),inplace=True)
df.Loan_Amount_Term.fillna(df.Loan_Amount_Term.mode()[0],inplace=True)

In [463]:
df.isnull().sum()

Loan_ID              0
Gender               0
Married              0
Dependents           0
Education            0
Self_Employed        0
ApplicantIncome      0
CoapplicantIncome    0
LoanAmount           0
Loan_Amount_Term     0
Credit_History       0
Property_Area        0
Loan_Status          0
dtype: int64

In [464]:
df.shape

(564, 13)

In [466]:
df.columns
df = df[['Gender', 'Married', 'Dependents', 'Education',
       'Self_Employed', 'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Loan_Status']]

In [506]:
from sklearn.preprocessing import LabelEncoder

df.Gender = LabelEncoder().fit_transform(df.Gender)
df.Married = LabelEncoder().fit_transform(df.Married)
df.Dependents = LabelEncoder().fit_transform(df.Dependents)
df.Education = LabelEncoder().fit_transform(df.Education)
df.Self_Employed = LabelEncoder().fit_transform(df.Self_Employed)
df.Property_Area = LabelEncoder().fit_transform(df.Property_Area)
df.Loan_Status = LabelEncoder().fit_transform(df.Loan_Status)
df.head()

,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,1,0,0,0,0,5849,0.0,145.088398,360.0,1.0,2,1
1,1,1,1,0,0,4583,1508.0,128.000000,360.0,1.0,0,0
2,1,1,0,0,1,3000,0.0,66.000000,360.0,1.0,2,1
3,1,1,0,1,0,2583,2358.0,120.000000,360.0,1.0,2,1
4,1,0,0,0,0,6000,0.0,141.000000,360.0,1.0,2,1

In [508]:
from sklearn.model_selection import train_test_split

x_train, x_test,y_train,y_test = train_test_split(df.drop('Loan_Status', axis = 1), df['Loan_Status'], test_size=.25)

In [509]:
from sklearn.linear_model import LogisticRegression
from sklearn.ensemble import RandomForestClassifier
from sklearn.metrics import accuracy_score, classification_report,confusion_matrix

In [513]:
model = LogisticRegression()

model.fit(x_train,y_train)
prediction = model.predict(x_test)

print(accuracy_score(y_test,prediction))
print(confusion_matrix(y_test,prediction))
print(classification_report(y_test,prediction))

0.8156028368794326
[[27 25]
 [ 1 88]]
              precision    recall  f1-score   support

           0       0.96      0.52      0.67        52
           1       0.78      0.99      0.87        89

    accuracy                           0.82       141
   macro avg       0.87      0.75      0.77       141
weighted avg       0.85      0.82      0.80       141

C:\Users\riman\Anaconda3\lib\site-packages\sklearn\linear_model\_logistic.py:763: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

In [521]:
import pandas as pd

df = pd.DataFrame({'A':['Rimanshu','Chirag']})
df.A.apply(lambda x : x.upper())

0    RIMANSHU
1      CHIRAG
Name: A, dtype: object

In [526]:
def factorial(num):
    if num ==1:
        return 1
    num = num*factorial(num-1)
    return num

print(factorial(5)) # 5,4,3,2

120